app/views/employees/index.html.erb

      <tr class="employee">
        <% if employee.profiles.active.present? %>
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."employee_id" = ? AND "profiles"."deleted_at" IS NULL  [["employee_id", 1]]