app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE (1) LIMIT ?  [["LIMIT", 1]]
SELECT "employees".* FROM "employees" LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "articles"
---
  def index
    @articles = Article.includes(:employee)
    @employees = Article.includes(:employee).page(params[:page]).per(5)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @article = Article.find_by(id: params[:id])

INSERT INTO "articles" ("title", "content", "employee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "てすと"], ["content", "dcsdcs"], ["employee_id", 1], ["created_at", "2022-10-30 16:27:21.207454"], ["updated_at", "2022-10-30 16:27:21.207454"]]
---
  def create
    @article = current_user.articles.new(article_params)
    if @article.save

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 9]]
---
  def destroy
    if @article.destroy!

SELECT "articles".* FROM "articles" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
    def set_article
      @article = current_user.articles.find(params[:id])