app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."deleted_at" IS NULL ORDER BY number asc LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "employees" WHERE "employees"."deleted_at" IS NULL
---
  def index
    @employees = Employee.active.order("#{sort_column} #{sort_direction}").page(params[:page]).per(5)

INSERT INTO "employees" ("department_id", "office_id", "number", "last_name", "first_name", "account", "password", "email", "date_of_joining", "employee_info_manage_auth", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @employee = Employee.new(employee_params)
    if @employee.save

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_employee
    @employee = Employee.find(params["id"])

SELECT "departments".* FROM "departments"
SELECT "offices".* FROM "offices"
---
  def set_form_option
    @departments = Department.all
    @offices = Office.all